Revit 2027 API
Face.Intersect(Curve) Method
Calculates the intersection of the specified curve with this face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SetComparisonResult Intersect(
	Curve curve
)
Public Function Intersect (
	curve As Curve
) As SetComparisonResult
public:
SetComparisonResult Intersect(
	Curve^ curve
)
member Intersect :
        curve : Curve -> SetComparisonResult
Parameters
curve Curve
The specified curve to intersect with this face.
Return Value
SetComparisonResult
SetComparisonResult.Overlap - One or more intersections were encountered.
SetComparisonResult.Subset - The curve is coincident with the surface.
SetComparisonResult.Disjoint - There is no intersection found.
Exceptions
Exception | Condition
ArgumentNullException |  The curve is null.
InvalidOperationException |  The intersection calculation fails.
See Also
Reference
Face Class
Intersect Overload
Autodesk.Revit.DB Namespace